Tekla.Structures.CatalogInternal.dotcatProfileItemSubTypeEnumerator_t
Serialization structure for Profile Item sub type Enumerator

Tekla.Structures.CatalogInternal.dotcatProfileItemSubTypeEnumerator_t.MoreProfilesItemSubTypesLeft
The more number of profile item sub types remaining.

Tekla.Structures.CatalogInternal.dotcatProfileItemSubTypeEnumerator_t.IndexToStart
The start index to enumerate the list.

Tekla.Structures.CatalogInternal.dotcatProfileItemSubTypeEnumerator_t.nProfileItemSubTypes
The number of profile items sub types.

Tekla.Structures.CatalogInternal.dotcatProfileItemSubTypeEnumerator_t.aSubTypeIds
The sub type id of the profile item sub type.
Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum

Tekla.Structures.CatalogInternal.dotcatProfileItemSubTypeEnumerator_t.aLabels
List of profile item sub type labels.

Tekla.Structures.CatalogInternal.dotcatProfileItemSubTypeEnumerator_t.aParameterStrings
List of profile item sub type parameter strings.

Tekla.Structures.CatalogInternal.dotcatProfileItemSubTypeEnumerator_t.aBitmaps
List of profile item sub type bitmap names.